app/views/listings/index.html.erb

SELECT "categories".* FROM "categories" INNER JOIN "categories_listings" ON "categories"."id" = "categories_listings"."category_id" WHERE "categories_listings"."listing_id" = ?  [["listing_id", 1]]
---
    <h3><%= link_to list.title, list.link %> <%= list.organization %></h3>
    <p><h4>$<%= list.salary %></h4> <small><% list.categories.each do |cat| %> <%= cat.title %>  <% end %></small></p>