app/views/listings/new.html.erb

SELECT "categories".* FROM "categories"
---
            <td><%= f.label :category %></td>
            <td><%= f.collection_select :category_ids, Category.all, :id, :title, {}, {:multiple => true} %></td>