app/views/shared/_categories.html.erb

SELECT "categories".* FROM "categories"  ORDER BY "categories"."title" ASC
SELECT COUNT(*) FROM "listings" INNER JOIN "categories_listings" ON "listings"."id" = "categories_listings"."listing_id" WHERE "categories_listings"."category_id" = ?  [["category_id", 2]]
---
    <% end %>
    <%= link_to cat.title + "(#{cat.listings.count})", category_path(cat), :class => "category" %></p>