app/views/shared/_listings.html.erb

        <h3><%= link_to list.title, list.link %> <%= list.organization %></h3>
        <p><h4>$<%= list.salary %></h4> <small><% list.categories.each do |cat| %> <%= link_to(cat.title, category_path(cat)) %>  <% end %></small></p>
---
SELECT "categories".* FROM "categories" INNER JOIN "categories_listings" ON "categories"."id" = "categories_listings"."category_id" WHERE "categories_listings"."listing_id" = ?  [["listing_id", 1]]