app/views/shared/_listings.html.erb

SELECT "listings".* FROM "listings" WHERE (title like '%test%')
SELECT COUNT(*) FROM "listings" WHERE (title like '%test%')
---
    <h5>No Job Postings Found in <%= City.find(params[:city]).title %></h5>
<% elsif Listing.all.empty? %>