app/controllers/categories_controller.rb

    def create
        category = Category.new(category_params)
        if category.save
---
INSERT INTO "categories" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "Administration"], ["created_at", "2016-06-01 22:03:33.568331"], ["updated_at", "2016-06-01 22:03:33.568331"]]

    def show
        @category = Category.find_by(id: params[:id])
        @listings = @category.listings.search(params[:search])
        @categories = Category.all.order(:title)
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 2]]
SELECT "categories".* FROM "categories"
SELECT "listings".* FROM "listings" INNER JOIN "categories_listings" ON "listings"."id" = "categories_listings"."listing_id" WHERE "categories_listings"."category_id" = ? AND (title like '%Test%')  [["category_id", 2]]
SELECT "categories".* FROM "categories"  ORDER BY "categories"."title" ASC