app/controllers/listings_controller.rb

SELECT "listings".* FROM "listings" WHERE (title like '%test%')
SELECT "categories".* FROM "categories"  ORDER BY "categories"."title" ASC
---
    def index
       @listings = Listing.search(params[:search])
       @categories = Category.all.order(:title)

INSERT INTO "listings" ("title", "link", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "test01"], ["link", "http://www.quickscope.com"], ["description", "Test post"], ["created_at", "2016-06-01 20:22:08.396725"], ["updated_at", "2016-06-01 20:22:08.396725"]]
---
    def create
        list = Listing.new(listing_params)
        if list.save