app/controllers/sessions_controller.rb

SELECT  "admins".* FROM "admins" WHERE "admins"."username" = ? LIMIT 1  [["username", "houssam"]]
---
    def create
        user = Admin.find_by_username(params[:session][:username])